* DONE Look at James' C code
  CLOCK: [2015-05-29 Fri 10:09]--[2015-05-29 Fri 10:18] =>  0:09
* DONE Call about a credit card  
  CLOCK: [2015-05-29 Fri 10:01]--[2015-05-29 Fri 10:08] =>  0:07
  Card was shipped today should be here on Wednesday
* DONE Is AlarmDB staging using folding alarms ?
  No  
* TODO Find out about setting up a user agreement for onping
* TODO Fix cobalt kiosk backend to use forms for indexing
* TODO Cobalt Form Features and Tasks
** TODO Add some way of culling fields unwanted for display
** TODO Add excel spreadsheet output
** TODO Add some form of type to prepare an invoice
* TODO Gather all quote info into a real quote
  CLOCK: [2015-05-19 Tue 11:17]--[2015-05-19 Tue 14:07] =>  2:50
